<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    <u>Parte 3</font>
    </font>

<br><br>

**Objetivo:** Explorar comandos básicos da linguagem sub-linguagem de manipulaçào de dados em SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
 * Explorar a especificação de múltiplas tabelas na cláusula `FROM` do comando `SELECT`
   * Condições de junção na cláusula `WHERE`
   * Condições de junção na cláusula `FROM`
   * Correspondência entre as junções da teoria e a sintaxe em SQL
   * Exemplo de aplicação de um `NATURAL FULL JOIN`

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [2]:
#Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

# Conectar com um servidor SQL na base Alunos 15 --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/alunos15')
%sql postgresql://postgres:postgres@localhost/alunos15

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<br><br>

----

<br>

## 2 Trabalhando com mais de uma tabela

A cláusula `FROM` permite indicar mais de uma tabela.

O resultado de um comando sempre deve ser exatamente <u><b>uma</b></u> tabela.\
Assim, quando mias de uma é especificada, elas têm que ser operadas
  * ou por Junção $R_1\stackrel{c}{\bowtie}R_2$
  * ou por Produto Cartesiano $R_1\times R_2$,\
    <font size="6">&emsp; &#9758;</font> 
    para que o resultado sempre seja uma tabela só.

<font color="red" size="6">&emsp;&emsp; &#9758;</font> Uma junção requer 
    uma comparação <font color="blue" size="3">$c=(R_1.a_1\;\theta\; R_2.a_2)$</font><br>
    &emsp; &emsp; &emsp; &emsp; envolvendo um (ou mais) atributo <font color="blue" size="3">$a_1$</font>
    da relação <font color="blue" size="3">$R_1$</font><br>
    &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; com um (ou mais) atributo <font color="blue" size="3">$a_2$</font>
    da relação <font color="blue" size="3">$R_2$</font>.

Caso a condição não seja expressa, impõe-se a execução do produto cartesiano.

<br>

  * A condição <font color="blue" size="3">$c$</font> pode ser expressa \
    tanto na cláusula `WHERE` quanto na cláusula `FROM`.

<br><br>

----

<br>

### 2.1 Indicar condições de junção na cláusula `WHERE`

A cláusula `WHERE` é mais direta, mas permite expressar apenas $\theta$-junções e equi-junçoes:\
&emsp; Basta indicar a condição de cada junção, expressando na comparação um atributo de cada tabela a ser operada.

  * Junções são expressas na cláusula `WHERE` indicando as comparações entre atributos \
    das duas relações
    <font color="blue" size="3">$R_1$</font> e <font color="blue" size="3">$R_2$</font> envolvidas na operação:\
    <font color="blue" size="3">$R_1.a_1 \theta R_2.a_1 \wedge R_1.a_2 \theta R_2.a_2 \wedge \ldots R_1.a_i \theta R_2.a_i$</font>,\
     sendo que as relações são indicadas na cláusula `FROM` separadas por vírgulas.

Exemplo:
<i>Listar as notas em que o aluno 'Celso' foi aprovado</i>:<br>
&emsp; &emsp; $\upsigma_{\left({\mbox{\small\texttt{Aluno.nome='Celso'}}}\;\wedge\;\mbox{Matricula.NUSP}>=5.0\right)}$
 `Aluno`$\stackrel{\mbox{NUSP} \;\theta\; \mbox{NUSP}}{\bowtie}$ `Matricula`

Em SQL:

In [3]:
%%sql
SELECT Aluno.NUSP,Matricula.CodigoTurma, Nota
    FROM Aluno, Matricula                 --<<  tabelas
    WHERE Aluno.NUSP=Matricula.NUSP AND   --<< condição de junção 
          Nota>=5.0 AND                   --<< outras condições...
          Aluno.Nome='Celso';

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[(Decimal('2345'), Decimal('100'), Decimal('9')),
 (Decimal('2345'), Decimal('102'), Decimal('7')),
 (Decimal('2345'), Decimal('104'), Decimal('7'))]

Note-se que:
  * Para operar $N$ tabelas por junção, deve haver haver $N-1$ condições de junção.
  * Se depois de executar todas as junções ainda houver mais de uma tabela, \
    elas serão operadas por produto cartesiano.
  * Uma condição que "junta" duas tabelas pode ter qualquer quantidade de operadores de comparação, expressos tanto por conectivos lógicos quanto por expressões de tupla.

Exemplo:
<i>Listar o horário de aulas das disciplinas do aluno 'Celso' em que ele foi aprovado</i>:

In [4]:
%sql Result1 << /* Comparando cada atributo */          \
SELECT A.Nome, T.Sigla, H.Dia, H.Horario                \
    FROM Aluno A, matricula M, Turma T, Horaturma H     \
    WHERE A.NUSP=M.NUSP AND                             \
	             M.CodigoTurma=T.Codigo AND             \
				              T.Sigla=H.Sigla AND                             \
							  T.Numero=H.Numero AND                           \
       Nome='Celso' AND  /* Não existe outro atributo `Nome` em nenhuma tabela ... */ \
	   M.Nota>5;

## Compare com:
%sql Result2 << /* Comparando tuplas */                 \
SELECT A.Nome, T.Sigla, H.Dia, H.Horario                \
    FROM Aluno A, matricula M, Turma T, Horaturma H     \
    WHERE A.NUSP=M.NUSP AND                             \
	             M.CodigoTurma=T.Codigo AND             \
				              (T.Sigla, T.Numero)=(H.Sigla, H.Numero) AND     \
       Nome='Celso' AND                                 \
	   M.Nota>5;

print ('\nComparando atributos: Result1:\n', Result1, sep='')
print ('\nComparando Tuplas: Result2:\n', Result2, sep='')

 * postgresql://postgres:***@localhost/alunos15
6 rows affected.
Returning data to local variable Result1
 * postgresql://postgres:***@localhost/alunos15
6 rows affected.
Returning data to local variable Result2

Comparando atributos: Result1:
+-------+---------+---------+---------+
|  nome |  sigla  |   dia   | horario |
+-------+---------+---------+---------+
| Celso | SCE-179 | Segunda |    8    |
| Celso | SCE-179 | Quarta  |    8    |
| Celso | SMA-179 | Segunda |    10   |
| Celso | SMA-179 | Quarta  |    10   |
| Celso | SMA-179 | Sexta   |    16   |
| Celso | SCE-200 | Terça   |    10   |
+-------+---------+---------+---------+

Comparando Tuplas: Result2:
+-------+---------+---------+---------+
|  nome |  sigla  |   dia   | horario |
+-------+---------+---------+---------+
| Celso | SCE-179 | Segunda |    8    |
| Celso | SCE-179 | Quarta  |    8    |
| Celso | SMA-179 | Segunda |    10   |
| Celso | SMA-179 | Quarta  |    10   |
| Celso | SMA-179 | Sexta   |    16   |
| Celso | SCE-200 | Terça   |    10   |
+-------+---------+---------+---------+

<br><br>

----

<br>

### 2.2 Indicar condições de junção na cláusula `FROM`

A cláusula `FROM` permite expressar qualquer tipo de junção:

A sintaxe geral da cláusula  `From` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
SELECT [<u>ALL</u> | DISTINCT] $<$lista de atributos$>$<br>
   &emsp; FROM $<$Tabela$>$, $<$Tabela$>$...<br>
<br>
$<$Tabela$>$ = $<$Tabela Juntada$>$ | <br>
   &emsp; &emsp; &emsp; &emsp; ($<$Tabela Juntada$>$)<br>
<br>
$<$Tabela Juntada$>$ = $<$Tabela$>$ |<br>
   &emsp; &emsp; $<$Tabela$>$ $<$join-type$>$ ($<$Tabela Juntada$>$)<br>
   &emsp; &emsp; &emsp; &emsp; {ON $<$Condição Junção$>$ |<br>
   &emsp; &emsp; &emsp;&emsp;&emsp;USING ($<$atrib1$>$ [, ...])}<br>
<br>
$<$join-type$>$ = [<u>INNER</u>] | [CROSS] | [NATURAL] |<br>
   &emsp; &emsp; &emsp; &emsp; &emsp;&emsp; [{LEFT | RIGHT | FULL} OUTER]<br>
   &emsp; &emsp; &emsp; &emsp; &emsp;&emsp; JOIN
</font></b>
</div>

<br><br>

----

<br>

#### 2.2.1 Junção Natural $\times$ Equi-junção

<u>Exemplo de uma Junção Natural versus Equi-junção</u>

<i>Listar os códigos de todas as disciplinas em que cada aluno se matriculou:</i>

In [5]:
%%sql
SELECT A.Nome, T.Sigla, M.Nota
    FROM Aluno A JOIN Matricula M
                      USING (NUSP)                --< USING: Junção natural
                 JOIN Turma T
                      ON M.CodigoTurma= T.Codigo  --< ON: Equi-Junção
	WHERE Nome='Celso';

 * postgresql://postgres:***@localhost/alunos15
4 rows affected.

[('Celso', 'SCE-179', Decimal('9')),
 ('Celso', 'SMA-179', Decimal('4')),
 ('Celso', 'SMA-179', Decimal('7')),
 ('Celso', 'SCE-200', Decimal('7'))]

Além da sintaxe, note o que acontece com <u>os atributos comparados:</u>

In [6]:
%%sql
SELECT *
    FROM Aluno A JOIN Matricula M
                      USING (NUSP)                --< USING: Junção natural
                 JOIN Turma T
                      ON M.CodigoTurma= T.Codigo  --< ON: Equi-Junção
	WHERE Nome='Celso';

 * postgresql://postgres:***@localhost/alunos15
4 rows affected.

[(Decimal('2345'), 'Celso', Decimal('22'), 'Sao Carlos', 'Computação', Decimal('100'), Decimal('9'), 'SCE-179', Decimal('1'), Decimal('100'), Decimal('2024'), Decimal('30')),
 (Decimal('2345'), 'Celso', Decimal('22'), 'Sao Carlos', 'Computação', Decimal('101'), Decimal('4'), 'SMA-179', Decimal('1'), Decimal('101'), Decimal('2023'), Decimal('25')),
 (Decimal('2345'), 'Celso', Decimal('22'), 'Sao Carlos', 'Computação', Decimal('102'), Decimal('7'), 'SMA-179', Decimal('2'), Decimal('102'), Decimal('2024'), Decimal('30')),
 (Decimal('2345'), 'Celso', Decimal('22'), 'Sao Carlos', 'Computação', Decimal('104'), Decimal('7'), 'SCE-200', Decimal('2'), Decimal('104'), Decimal('2024'), Decimal('60'))]

Note que:
 * o atributo comparado por igual na junção natural não repete na resposta, (um `NUSP` só)
 * mas o atributo comparado por igual na equi-junção repete na resposta (`CódigoTurma` e `Codigo`).

Isso fica mais explícito se pedirmos todos os atributos de cada tabela (veja que o `NUSP`'ressurge' como `NUSP_1`:

In [7]:
%%sql
SELECT A.*, M.*, T.*
    FROM Aluno A JOIN Matricula M
                      USING (NUSP)                --< USING: Junção natural
                 JOIN Turma T
                      ON M.CodigoTurma= T.Codigo  --< ON: Equi-Junção
	WHERE Nome='Celso';

 * postgresql://postgres:***@localhost/alunos15
4 rows affected.

[('Celso', Decimal('2345'), Decimal('22'), 'Sao Carlos', 'Computação', Decimal('100'), Decimal('2345'), Decimal('9'), 'SCE-179', Decimal('1'), Decimal('100'), Decimal('2024'), Decimal('30')),
 ('Celso', Decimal('2345'), Decimal('22'), 'Sao Carlos', 'Computação', Decimal('101'), Decimal('2345'), Decimal('4'), 'SMA-179', Decimal('1'), Decimal('101'), Decimal('2023'), Decimal('25')),
 ('Celso', Decimal('2345'), Decimal('22'), 'Sao Carlos', 'Computação', Decimal('102'), Decimal('2345'), Decimal('7'), 'SMA-179', Decimal('2'), Decimal('102'), Decimal('2024'), Decimal('30')),
 ('Celso', Decimal('2345'), Decimal('22'), 'Sao Carlos', 'Computação', Decimal('104'), Decimal('2345'), Decimal('7'), 'SCE-200', Decimal('2'), Decimal('104'), Decimal('2024'), Decimal('60'))]

<br><br>

----

<br>

#### 2.2.2 Junção externa

<u>Exemplo de uma Junção Externa</u>

<i>Listar todas as disciplinas, com seus respectivos pré-requisitos:</i>

In [8]:
%%sql
SELECT D.Sigla, D.Nome, Pre.Sigla "Sigla Pre", Pre.Nome "Nome pre" 
    FROM Discip D LEFT OUTER JOIN Discip Pre    /*--- Note a tabela Discip sendo usada duas vezes:
                                                    - como a tabela de disciplinas (com alias D) e
                                                    - como a tabela de pré-requisitos (com alias Pre). */
                                  ON D.SiglaPreReq=Pre.Sigla;

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[('SCE-179', 'Base de Dados', 'SMA-179', 'Algebra'),
 ('SMA-179', 'Algebra', None, None),
 ('SCE-200', 'Lab. Base de Dados', 'SCE-179', 'Base de Dados')]

<br><br>

----

<br>

### 2.3 Correspondência entre os operadores de junção com a sintaxe SQL

  * Na teoria existem três operadores de Junção Interna:
	* $\theta$-junção,
    * equi-junção, e
    * junção natural.

  * Esses operadores sao interpretados em SQL assim:
    * Junções em que o operador de comparação não é o '=' são <u>$\theta$-junção;</u>
    * Junções comparando com '=' expressas na cláusula `WHERE` ou com a construção `ON` na cláusula `FROM` são <u>equi-junção</u>.
    * Junções comparando com '=' expressas com a construção `USING` ou `NATURAL JOIN` na cláusula `FROM` são <u>Junções Naturais</u>.

<br><br>

----

<br>

### 2.3.1 Aplicação de `NATURAL FULL OUTER JOIN`

Combinar `NATURAL FULL OUTER JOIN` pode ser útil para identificar diferenças em duas tabelas com a mesma estrutura (e mesmos nomes de atributos).

Suponha que temos uma tabela com o `NUSP` dos alunos que tiveram alguma reprovação, e outra com os alunos que tiveram alguma aprovação.\
provavelmente, a maioria dos alunos estará em ambas as tabelas.

A seguinte consulta mostra quem aprovou em todas as disciplinas e quem reprovou em todas:\
<small>(Cada uma dessas duas tabelas está sendo criada temporariamente, com um comando que será estudado logo a seguir)</small>

In [9]:
%%sql
WITH Aprov as (   -- Criar uma tabela com alunos que reprovaram em ao menos uma disciplina
    SELECT DISTINCT NUSP FROM Matricula R WHERE Nota <5),
  Reprov AS (     -- Criar uma tabela com alunos que aprovaram em ao menos uma disciplina
    SELECT DISTINCT NUSP FROM Matricula R WHERE Nota >=5)

SELECT * 
    FROM (SELECT 'Aprovou todas'  AS Result1, Aprov.* FROM Aprov) T1
       NATURAL FULL OUTER JOIN                                      --======<<<< Usando Natural-Join externo
         (SELECT 'Reprovou todas' AS Result2, Reprov.* FROM Reprov) T2
WHERE T1 IS NULL or T2 IS NULL;

 * postgresql://postgres:***@localhost/alunos15
8 rows affected.

[(Decimal('1459'), 'Aprovou todas', None),
 (Decimal('2344'), 'Aprovou todas', None),
 (Decimal('1469'), 'Aprovou todas', None),
 (Decimal('9123'), None, 'Reprovou todas'),
 (Decimal('5678'), None, 'Reprovou todas'),
 (Decimal('6789'), None, 'Reprovou todas'),
 (Decimal('9012'), None, 'Reprovou todas'),
 (Decimal('7890'), None, 'Reprovou todas')]

Nesse comando:
  * Como a junção natural não repete os atributos que ocorrem nas duas tabelas,\
     o resultado contém apenas um conjunto de atributos.
  * A junção externa inclui os alunos que não estão na outra tabela.
  * A condição da cláusula `WHERE` remove os alunos que estão em ambas as tabelas.

__Pergunta:__ <i>Qual a vantagem dessa solução sobre usar os operadores sobre conjuntos?</i> \
(ou seja, sobre:)

In [10]:
%%sql
WITH Aprov as (
    SELECT NUSP FROM Matricula R WHERE Nota >=5),
  Reprov AS ( 
    SELECT NUSP FROM Matricula R WHERE Nota <5)

(SELECT *, 'Aprov' FROM Aprov EXCEPT SELECT *, 'Aprov' FROM Reprov)
    UNION                                                          ---====<<<< usando operadores de conjunto
(SELECT *, 'Reprov' FROM Reprov EXCEPT SELECT *, 'Reprov' FROM Aprov)
ORDER BY NUSP;

 * postgresql://postgres:***@localhost/alunos15
8 rows affected.

[(Decimal('1459'), 'Reprov'),
 (Decimal('1469'), 'Reprov'),
 (Decimal('2344'), 'Reprov'),
 (Decimal('5678'), 'Aprov'),
 (Decimal('6789'), 'Aprov'),
 (Decimal('7890'), 'Aprov'),
 (Decimal('9012'), 'Aprov'),
 (Decimal('9123'), 'Aprov')]

__Resposta:__ Responder com junção requer <u>ler cada tabela apenas uma vez,</u>\
  &emsp; enquanto usar operadores sobre conjuntos requer <u>ler cada tabela duas vezes.</u>

In [11]:
%%sql 
WITH Aprov as (
    SELECT DISTINCT NUSP, 'Aprov' Situacao
        FROM Matricula M
        WHERE NUSP NOT IN (SELECT NUSP FROM Matricula R WHERE Nota <5)
	),
  Reprov AS ( 
    SELECT DISTINCT NUSP, 'Reprov'
        FROM Matricula M
        WHERE NUSP NOT IN (SELECT NUSP FROM Matricula R WHERE Nota >=5)
	)
SELECT * FROM Aprov UNION SELECT * FROM Reprov
ORDER BY 1

 * postgresql://postgres:***@localhost/alunos15
10 rows affected.

[(Decimal('1459'), 'Reprov'),
 (Decimal('1469'), 'Reprov'),
 (Decimal('1479'), 'Aprov'),
 (Decimal('1479'), 'Reprov'),
 (Decimal('2344'), 'Reprov'),
 (Decimal('5678'), 'Aprov'),
 (Decimal('6789'), 'Aprov'),
 (Decimal('7890'), 'Aprov'),
 (Decimal('9012'), 'Aprov'),
 (Decimal('9123'), 'Aprov')]


<br><br>

----

<br><br>

Outro exemplo (adaptado da aula sobre a teoria da Álgebra Relacional):\
<i>Listar todos os alunos de computação, cada um com as respectivas disciplinas em que se matricularam.
</i>

In [12]:
%%sql
SELECT Aluno.Nome, Discip.Nome, Matricula.Nota, Turma.Ano
    FROM  Aluno FULL OUTER JOIN                           --< Aluno     tem o nome do aluno e o curso
              (Matricula JOIN                             --< Matricula tem as turmas onde ele se matriculou
                  (Turma JOIN Discip                      --< Turma     tem a disciplina a que corresponde aquela turma
                       ON Discip.Sigla=Turma.sigla)       --< Discip    tem o nome da disciplina    
                 ON Turma.Codigo=Matricula.CodigoTurma)
			ON Aluno.NUSP=Matricula.NUSP
    WHERE Aluno.Curso='Computação'
    ORDER BY Aluno.NUSP, Matricula.CodigoTurma, Turma.Ano

 * postgresql://postgres:***@localhost/alunos15
23 rows affected.

[('Carlos', 'Base de Dados', Decimal('8'), Decimal('2024')),
 ('Carlos', 'Algebra', Decimal('9'), Decimal('2023')),
 ('Carlos', 'Lab. Base de Dados', Decimal('4'), Decimal('2024')),
 ('Durval', 'Lab. Base de Dados', None, Decimal('2024')),
 ('Daniel', None, None, None),
 ('Celso', 'Base de Dados', Decimal('9'), Decimal('2024')),
 ('Celso', 'Algebra', Decimal('4'), Decimal('2023')),
 ('Celso', 'Algebra', Decimal('7'), Decimal('2024')),
 ('Celso', 'Lab. Base de Dados', Decimal('7'), Decimal('2024')),
 ('Carlitos', 'Base de Dados', Decimal('7'), Decimal('2024')),
 ('Carlitos', 'Algebra', Decimal('4'), Decimal('2023')),
 ('Carlitos', 'Algebra', Decimal('10'), Decimal('2024')),
 ('Carlitos', 'Lab. Base de Dados', Decimal('4'), Decimal('2024')),
 ('Carlitos', 'Lab. Base de Dados', Decimal('7'), Decimal('2024')),
 ('Cibele', 'Algebra', Decimal('6'), Decimal('2023')),
 ('Cibele', 'Lab. Base de Dados', Decimal('5'), Decimal('2024')),
 ('Celina', 'Base de Dados', Decimal('4'), Decimal('2024')),
 ('Celina', 'Algebra', Decimal('3'), Decimal('2023')),
 ('Celina', 'Algebra', Decimal('9'), Decimal('2024')),
 ('Celina', 'Lab. Base de Dados', Decimal('8'), Decimal('2024')),
 ('Celia', 'Base de Dados', Decimal('6'), Decimal('2024')),
 ('Celia', 'Algebra', Decimal('9'), Decimal('2023')),
 ('Celia', 'Lab. Base de Dados', Decimal('9'), Decimal('2024'))]

Veja que o `Aluno Daniel` é da 'Computação', mas como não se matriculou em nenhuma disciplina,\
 &emsp; sem o `OUTER JOIN` ele teria ficado fora da listagem.


<br><br>

----

<br><br>

<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    <b>DML</b>
    </font><br>

<img src="Figuras/ICMC_Logo.jpg" width=70>&emsp;
<font size="10" face="verdana" color="red"><b>FIM</b>&nbsp;&nbsp;&nbsp;&nbsp;</font>
<font size="5" face="verdana" color="green"> Parte 3
</font>\
<img src="Figuras/Gbdi2005.jpg" width=400>